import { Box, Typography } from "@mui/material"
import "./style.css"

import Rating from '@mui/material/Rating';
import Stack from '@mui/material/Stack';
 

const FavoriteMoviePages = () =>{
    return(
        <>
            <Box sx={{ backgroundColor: "#121212", color: "#fff", p: 3, width: "100vw", minHeight: "100vh" }}>

                <Box sx={{ display: "flex", alignItems: "center",gap:"20px"}}>
                    <Box sx={{width:"25%",backgroundColor: "#333634"}}>
                        <Box
                        component="img"
                        src="https://uaserial.com/images/serials/65/659ff274ec8f1697800079.webp" 
                        alt="Album Cover"
                        sx={{ width: "100%", mr: 2 }}
                        />

                        <Box className ="FilmName">
                            <h3>
                                Багряний пік
                            </h3>
                            <h5>
                                2015 ‧ Жахи/Романтика ‧ 1г 59х
                            </h5>
                            <Stack spacing={1} style={{alignItems:"center",padding:"10px 0px"}}>
                                <h6>IMDb rating 6.5</h6>
                                <Rating name="half-rating-read" defaultValue={6.5} precision={0.5} max={10} readOnly />
                            </Stack>
                        </Box>

                    </Box>  

                    <Box sx={{width:"75%" }} >
                        <Typography variant="li" color="gray">
                        «Багряний пік» (англ. Crimson Peak) — американський фільм жахів режисера, продюсера і сценариста Гільєрмо дель Торо, що вийшов 2015 року. У головних ролях Міа Васіковська, Джессіка Честейн, Том Гіддлстон.

                                    Вперше фільм продемонстрували 25 вересня 2015 року у США на Fantastic Fest[1]. В Україні у кінопрокаті показ фільму розпочався 15 жовтня 2015 року[7][2].

                                    Сюжет
                                    Фільм починається з похорону матері дівчинки Едіт Кашинг у 1887 році. Згодом дівчинку відвідує жахливий привид померлої та застерігає: «Стережися Багряного піку!»

                                    Минає 14 років і доросла Едіт стає письменницею, що пише готичні історії. У неї закоханий Алан Макмайкл, лікар та друг дитинства. Йому Едіт зізнається, що іноді бачить привидів, зокрема їй знову явився привид матері. Алан вірить у це, пояснюючи видіння тим, що Едіт має перевагу в своєму зорі порівняно з іншими людьми, подібно до того як звичайні люди над дальтоніками. До батька Едіт Картера прибуває молодий винахідник Томас Шарп, шукаючи гроші для своєї машини для видобування червоної глини, з якої роблять якісну цеглу і черепицю. Попри потребу в такій сировині, Картер відмовляє, посилаючись на те, що Томас не має значних статків та походить зі знатного роду, тому не вміє заробляти на життя сумлінною працею. Проте Едіт зачарована манерами Шарпа, що батько різко не схвалює. Невдовзі Картер загадковим чином гине і стосункам Едіт з Томасом більш нічого не заважає. Гроші батька переходять їй у спадок і дівчина вирішує дати їх Томасу для будівництва його машини.

                                    Після одруження Едіт переселяється в маєток Шарпа — старовинний будинок, що стоїть в місцевості, де добувають червону глину. Шарп живе там з сестрою Люсіль. Сам маєток лякає Едіт холодом і дивними звуками, що її чоловік з сестрою пояснюють старістю конструкцій та вітром. Томас попереджає дружину, щоб вона не спускалася до підвалу, що веде в глиняні копальні. Через глину в землі вода з водопроводу нагадує кров, а скоро Едіт стає бачити привида у вигляді червоної людини без шкіри. На питання чи ніхто в маєтку не гинув насильницькою смертю, Томас знаходить відмовки та згадує про свою сувору матір, з якою він та Люсіль жили тут раніше. Він будує глинодобувну машину, однак говорить дружині, що для її довгої роботи будуть потрібні дорогі деталі, на які Едіт дає іще частину спадку. Між іншим він повідомляє назву цієї місцини — Багряний пік, що походить від кольору глини.

                                    Чергова поява страховиська приводить Едіт до сховку з восковими циліндрами. Через неполадку ліфта вона опиняється в підвалі, де знаходить закриту скриню. Вкравши ключ від неї в Люсіль, Едіт вже сама спускається у підвал і дістає зі скрині грамофон з іншими восковими циліндрами. На циліндрах виявляється записи голосів жінок — колишніх дружин Томаса, котрих він з Люсіль звели в могилу, підсипаючи у чай отруту. Едіт виявляє, що отрута вже діє і на неї, викликаючи кровотечу. До того ж в підвалі в чанах з глиною вона виявляє чийсь кістяк.

                                    Тим часом Алан Макмайкл підозрює, що смерть Картера була вбивством. Він розшукує інформацію про Шарпа і його сестру та знаходить вирізки з газети про них. Алан миттю вирушає до Багряного піку розповісти Едіт правду.

                                    Едіт наважується заговорити з привидом і той приводить її до кімнати, де Томас кохається з власною сестрою. Люсіль, бачачи, що її з братом таємницю розкрито, береться переслідувати Едіт та скидає її зі сходів. Та скоро до маєтку прибуває Алан, наполягаючи на тому, що Едіт слід відвезти в лікарню. Томас і Люсіль задумують вбити Алана, а той розповідає їм усе, що дізнався в ході своїх розслідувань.

                                    Маленька Люсіль вбила свою матір тесаком у ванні після того, як та дізналася про інцест своїх дітей. Ніхто не повірив, що діти є вбивцями, і Люсіль відправили лікуватися, а Томаса — в пансіон. За кілька років вони повернулися в маєток, але не мали грошей. Томас став знаходити багатих дівчат без рідні, а Люсіль вбивала їх, при цьому обманним чином відбираючи статки.

                                    Люсіль доручає брату заколоти Алана ножем, але той тихцем запитує його куди слід вдарити, щоб Алан лишився живим. Завдавши удару, Томас пояснює йому як дістатися до шахти і втекти. Томас рятує Едіт, спалюючи підписані чеки, і каже сестрі, що закохався по-справжньому — в Едіт. Розлючена Люсіль вбиває брата ударом ножа і біжить за Едіт помститися їй. Вони з перемінним успіхом борються в маєтку і в шахті. Коли обоє вибираються на поверхню, Люсіль бачить привид Томаса, а Едіт, користуючись нагодою, вбиває її лопатою. Едіт каже привиду Томаса, що буде завжди його пам'ятати і той, бачачи, що його самопожертва не стала марною, зникає.

                                    Разом з Аланом Едіт покидає маєток, який занепадає, а в його кімнатах оселяється привид Люсіль. Фільм закінчується показом книги з назвою «Багряний пік», автором якої стала Едіт Кашинг.
                        </Typography>

                    </Box>

                </Box>
            </Box>

             
            

        </>
    )
}

export default FavoriteMoviePages